zhanzr/liteos-xmc1100/platform/STM32L053_NUCLEO/main.c
#include "los_sys.h"
#include "los_tick.h"
#include "los_task.ph"
#include "los_config.h"

#include "los_bsp_led.h"
#include "los_bsp_key.h"
#include "los_bsp_uart.h"
#include "los_inspect_entry.h"
#include "los_demo_entry.h"

#include "stm32l0xx_hal.h"

#include <string.h>

#ifdef LOS_CMBACKTRACE_COMPILE
#define HARDWARE_VERSION               "V1.0.0"
#define SOFTWARE_VERSION               "V0.1.0"
#endif

extern void LOS_EvbSetup(void);

static uint32_t g_uwboadTaskID;
static  void LOS_BoardExampleTskfunc(void)
{
    while (1)
    {
        LOS_EvbLedControl(LOS_LED2, LED_ON);
        LOS_EvbUartWriteStr("Board Test\n");
        (void)LOS_TaskDelay(500);
        LOS_EvbLedControl(LOS_LED2, LED_OFF);
        (void)LOS_TaskDelay(500);
    }
}

void LOS_BoardExampleEntry(void)
{
    uint32_t uwRet;
    TSK_INIT_PARAM_S stTaskInitParam;

    (void)memset((void *)(&stTaskInitParam), 0, sizeof(TSK_INIT_PARAM_S));
    stTaskInitParam.pfnTaskEntry = (TSK_ENTRY_FUNC)LOS_BoardExampleTskfunc;
    stTaskInitParam.uwStackSize = LOSCFG_BASE_CORE_TSK_IDLE_STACK_SIZE;
    stTaskInitParam.pcName = "BoardDemo";
    stTaskInitParam.usTaskPrio = 10;
    uwRet = LOS_TaskCreate(&g_uwboadTaskID, &stTaskInitParam);

    if (uwRet != LOS_OK)
    {
        return;
    }
    return;
}

/*****************************************************************************
Function    : main
Description : Main function entry
Input       : None
Output      : None
Return      : None
 *****************************************************************************/

int main(void)
{
    uint32_t uwRet;
    /*
        add you hardware init code here
        for example flash, i2c , system clock ....
     */
//    HAL_init();
    
#ifdef LOS_CMBACKTRACE_COMPILE
    cm_backtrace_init("LOS_CmBacktrace", HARDWARE_VERSION, SOFTWARE_VERSION);
#endif

    /*Init LiteOS kernel */
    uwRet = LOS_KernelInit();
    if (uwRet != LOS_OK) {
        return LOS_NOK;
    }
    /* Enable LiteOS system tick interrupt */
    uwRet = LOS_EnableTick();
    if (uwRet != LOS_OK) {
        return LOS_NOK;
    }
   
    /*
        Notice: add your code here
        here you can create task for your function 
        do some hw init that need after systemtick init
     */
    LOS_EvbSetup();//init the device on the dev baord

    //LOS_Demo_Entry();

    LOS_Inspect_Entry();

    //LOS_BoardExampleEntry();

    /* Kernel start to run */
    (void)LOS_Start();
    for (;;);
    /* Replace the dots (...) with your own code. */
}
